{
  "001": "Following whitespace collapse, the referenced file failed validation against the DPI XML Schema.",
  "002": "Only one record (DPIBody) is allowed per XML submission.",
  "003": "The root element DPI_OECD version attribute must be present and must be set to the current schema version.",
  "004": "SendingEntityIN is a mandatory element.",
  "005": "The MessageSpec.SendingEntityIN must match an active Platform Operator ID subscribed to the submitter.",
  "006": "The MessageType can only be DPI.",
  "007": "Filename must match MessageRefId.",
  "008": "The Digital Platform ID within the MessageRefId does not match the content of the MessageSpec.SendingEntityIN element.",
  "009": "The Reporting Period within the MessageRefId/DocRefId does not match the content of the MessageSpec.ReportingPeriod element.",
  "010": "If MessageTypeIndic is DPI401 or DPI402, a DPIBody must be present.",
  "011": "If MessageTypeIndic is DPI401, the PlatformOperator DocTypeIndic must be OECD0 or OECD1, the OtherPlatformOperators DocTypeIndic (if present) must be OECD1 and ReportableSeller DocTypeIndic(s) (if present) must be OECD1.",
  "012": "If MessageTypeIndic is DPI401 and the PlatformOperator DocTypeIndic is OECD1, the OtherPlatformOperators element and/or ReportableSeller element(s) must be present.",
  "013": "If MessageTypeIndic is DPI402, it can not contain the DocTypeIndic of OECD1.",
  "014": "If MessageTypeIndic is DPI402 and PlatformOperator DocTypeIndic is OECD0, then either the OtherPlatformOperators and/or ReportableSeller element(s) must be present.",
  "015": "???",
  "016": "If MessageTypeIndic is DPI403 and a DPIBody is present it cannot contain any AssumedPlatformOperator(s) or ReportableSeller(s).",
  "017": "Multiple Nil Reports (DPI403) cannot be made for the same Reporting Period.",
  "018": "If the DocRefId or CorrDocRefId in a DPI401 or DPI402 PlatformOperator refers to a DPI403, it can only contain DocTypeIndic(s) of OECD3.",
  "019": "If PlatformOperator DocTypeIndic is OECD0 the ReportingPeriod of the MessageSpec must be the same as the previous submission. ",
  "020": "The ReportingPeriod of the MessageSpec cannot be changed. ",
  "021": "The ReportingPeriod cannot contain a date earlier than 2024.",
  "022": "The ReportingPeriod cannot contain a future date beyond the current calendar year.",
  "023": "The ReportingPeriod must be the end of the relevant calendar year.",
  "024": "With OECD0, the CorrDocRefId must not be present.",
  "025": "Unless it is an OECD0, the first part of the DocRefId must match the MessageRefId of the file.",
  "026": "???",
  "027": "The ResCountryCode is mandatory for the PlatformOperator, AssumingPlatformOperator, AssumedPlatformOperator and EntSellerID elements when present.",
  "028": "If multiple TIN elements are present within  the same platform operator or reportable seller then the unknown attribute can not be \"true\".",
  "029": "TIN length must be greater than or equal to 1 character.",
  "030": "If TIN is \"NOTIN\", the unknown attribute must be present and set to \"true\" and the issuedBy attribute must not be present.",
  "031": "If TIN is not \"NOTIN\" the issuedBy attibute must be present and if the unknown attribute is present it must be \"false\".",
  "032": "???",
  "033": "The Nationality element is not to be used for OECD DPI reporting.",
  "034": "PlatformBusinessName is mandatory in the PlatformOperator element.",
  "035": "The legalAddressType of the PlatformOperator must contain at least one address that represents the Registered Office Address (OECD304).",
  "036": "AssumedReporting is mandatory in the PlatformOperator element.",
  "037": "The CorrDocRefId refers to a different element to that which it is correcting.",
  "038": "???",
  "039": "If PlatformOperator.AssumedReporting is \"true\", the AssumedPlatformOperator element of the OtherPlatformOperators must not be present.",
  "040": "If PlatformOperator.AssumedReporting is \"false\", the AssumingPlatformOperator element of the OtherPlatformOperators must not be present.",
  "041": "If MessageTypeIndic is DPI401, PlatformOperator DocTypeIndic is OECD1 and PlatformOperator.AssumedReporting is \"true\", the AssumingPlatformOperator element of the OtherPlatformOperators must be present.",
  "042": "If MessageTypeIndic is DPI401, PlatformOperator DocTypeIndic is OECD0 and PlatformOperator.AssumedReporting is \"true\", the OtherPlatformOperator element can not be present.",
  "043": "If MessageTypeIndic is DPI402, PlatformOperator DocTypeIndic is OECD0 or OECD2 and PlatformOperator.AssumedReporting is \"true\", the AssumingPlatformOperator DocTypeIndic can not be OECD3.",
  "044": "If PlatformOperator DocTypeIndic is OECD0, OECD2 or OECD3 the PlatformOperator.AssumedReporting value must be the same as the previous submission.",
  "050": "The AssumingPlatformOperator can not be deleted without deleting the PlatformOperator.",
  "051": "If AssumedReporting is true, the ReportableSeller element can not be present.",
  "052": "If MessageTypeIndic is DPI403, the PlatformOperator DocTypeIndic must be OECD1, the OtherPlatformOperators.AssumingPlatformOperator DocTypeIndic (if present) must be OECD1.",
  "053": "The CorrDocRefId specified does not relate to the Parent record (PlatformOperator DocRefId).",
  "054": "The ReportableSeller.RelevantActivities element must contain at least one activity (ImmovableProperty, PersonalServices, SalesOfGoods or TransportationRental)",
  "055": "The PlatformBusinessName element must not be used for an EntitySeller.",
  "056": "The AssumedReporting element must not be used for an EntitySeller.",
  "057": "???",
  "058": "The GVS.JurisdictionGVS cannot be GB as the UK does not operate GVS.",
  "059": "The PropertyListing.OtherPropertyType element must always be present if PropertyListing.PropertyType is DPI910.",
  "060": "The PropertyListing.OtherPropertyType element must not be present if PropertyListing.PropertyType is anything other than DPI910.",
  "061": "The OECD0 DocRefId in the PlatformOperator does not relate to a PlatformOperator in a previous submission.",
  "50005": "Submissions must not include Prohibited Characters or Entity References in the MessageRefId or DocRefId. Submissions must not include Prohibited Characters, these have to be escaped using Entity References in all element values in the DPIBody. Submissions must not include any of the Character Combinations in the SQL threat injection list.",
  "50007": "The referenced file failed validation against the DPI XML Schema.",
  "50008": "The structure of the MessageRefId is not in the correct format, as set out in the HMRC Business Rules Document.",
  "50009": "The referenced file has a duplicate MessageRefId value that was received on a previous file.",
  "50010": "The referenced file contains one or more records with a DocTypeIndic value in the range OECD10-OECD13, indicating test data. As a result, the receiving Competent Authority cannot accept this file as a valid DPI file submission.",
  "80000": "The DocRefId is already used for another record.",
  "80001": "The structure of the DocRefId is not in the correct format, as set out in the HMRC Business Rules Document.",
  "80002": "The CorrDocRefId refers to an unknown record.",
  "80003": "The corrected record is no longer valid (invalidated or outdated by a previous correction message). As a consequence, no further information should have been received on this version of the record.",
  "80004": "The initial element specifies a CorrDocRefId.",
  "80005": "The corrected element does not specify any CorrDocRefId.",
  "80006": "The CorrMessageRefId is forbidden within the DocSpec_Type.",
  "80007": "The CorrMessageRefId is forbidden within the Message Header.",
  "80008": "Resend option (OECD0) cannot be used for the correctable record specified.",
  "80009": "The Parent record cannot be deleted without deleting all related Child records (either in same message or in previous messages).",
  "80010": "A message can contain either new records (OECD1) or corrections/deletions (OECD2 and OECD3), but cannot contain a mixture of both.",
  "80011": "The same DocRefId cannot be corrected or deleted twice in the same message.",
  "80012": "???",
  "80013": "???",
  "80014": "The DocRefId specified for the Resend option (OECD0) is no longer valid (invalidated or outdated by a previous correction message)."
}